AccumulationRegisters/ОборотыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоКатегориям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ДБ_ОбщегоНазначения/Ext/Module.bsl
Функция ПолучитьЛимитКатегории(СсылкаНаКатегорию) Экспорт
	Если Не ЗначениеЗаполнено(СсылкаНаКатегорию) Тогда
		Возврат 0;
	КонецЕсли;
	
	Лимит = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаКатегорию, "Лимит");
	
	Если (Лимит = 0 Или Лимит = Неопределено) Тогда
		Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаКатегорию, "Родитель");
		
		Если ЗначениеЗаполнено(Родитель) Тогда
			Лимит = ПолучитьЛимитКатегории(Родитель);
		КонецЕсли;
		КонецЕсли;
		
		Возврат ?(Лимит < 0, 0, Лимит);
КонецФункции  

Функция ПолучитьСуммуРасходаЗаМесяц(СсылкаНаКатегорию, СсылкаНаПользователя)Экспорт 
	   Запрос = Новый Запрос;
	   Запрос.Текст=
	   "ВЫБРАТЬ
	   |	ЕСТЬNULL(Обороты.СуммаРасход,0) КАК Сумма
	   |ИЗ
	   |	РегистрНакопления.ОборотыПоКатегориям.Обороты(&Начало, &Конец,, Категория = &Категория И Пользователь = &Пользователь ) КАК Обороты";
	   Запрос.УстановитьПараметр("Начало", НачалоМесяца(ТекущаяДата()));
	   Запрос.УстановитьПараметр("Конец", КонецМесяца(ТекущаяДата()));
	   Запрос.УстановитьПараметр("Пользователь", СсылкаНаПользователя);
	   Запрос.УстановитьПараметр("Категория", СсылкаНаКатегорию);
	   Выборка = Запрос.Выполнить().Выбрать();
	   
	   Возврат ?(Выборка.Следующий(), Выборка.Сумма, 0);
КонецФункции
